micropython/micropython/ports/esp32/machine_pwm.c
// This called from Ctrl-D soft reboot
void machine_pwm_deinit_all(void) {
    if (pwm_inited) {
        for (int mode = 0; mode < LEDC_SPEED_MODE_MAX; ++mode) {
            for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
                pwm_deinit(mode, channel);
            }
        }
        pwm_inited = false;
    }
}

static void pwm_is_active(machine_pwm_obj_t *self) {
    if (self->timer < 0) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("PWM is inactive"));
    }
}

// Calculate the duty parameters based on an ns value
static int ns_to_duty(machine_pwm_obj_t *self, int ns) {
    pwm_is_active(self);
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    int64_t duty = ((int64_t)ns * UI16_DUTY * timer->freq_hz + 500000000LL) / 1000000000LL;
    if ((ns > 0) && (duty == 0)) {
        duty = 1;
    } else if (duty > UI16_DUTY) {
        duty = UI16_DUTY;
    }
    return duty;
}

static int duty_to_ns(machine_pwm_obj_t *self, int duty) {
    pwm_is_active(self);
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    int64_t ns = ((int64_t)duty * 1000000000LL + (int64_t)timer->freq_hz * UI16_DUTY / 2) / ((int64_t)timer->freq_hz * UI16_DUTY);
    return ns;
}

static void configure_pin(machine_pwm_obj_t *self) {
    // reconfigure PWM pin output as input/output
    gpio_set_direction(self->pin, GPIO_MODE_INPUT_OUTPUT);
    if (self->mode == LEDC_LOW_SPEED_MODE) {
        esp_rom_gpio_connect_out_signal(self->pin, LEDC_LS_SIG_OUT0_IDX + self->channel, self->output_invert, false);
    #if SOC_LEDC_SUPPORT_HS_MODE
    } else if (self->mode == LEDC_HIGH_SPEED_MODE) {
        esp_rom_gpio_connect_out_signal(self->pin, LEDC_HS_SIG_OUT0_IDX + self->channel, self->output_invert, false);
    #endif
    }
}

#define apply_duty(self) debug_printf0("apply_duty(self->channel=%d,self->channel_duty=%d,self->pin=%d,self->mode=%d,self->timer=%d)", self->channel,self->channel_duty,self->pin,self->mode,self->timer); _apply_duty(self) ;
static void _apply_duty(machine_pwm_obj_t *self) {
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];

    int duty = 0;
    if (self->duty_x == UI_RES_16_BIT) {
        duty = self->duty_ui;
    } else if (self->duty_x == UI_RES_10_BIT) {
        duty = self->duty_ui << (UI_RES_16_BIT - UI_RES_10_BIT);
    } else if (self->duty_x == -UI_RES_16_BIT) {
        duty = ns_to_duty(self, self->duty_ui);
    }

    int channel_duty;
    if (timer->duty_resolution <= UI_RES_16_BIT) {
        channel_duty = duty >> (UI_RES_16_BIT - timer->duty_resolution);
    } else {
        channel_duty = duty << (timer->duty_resolution - UI_RES_16_BIT);
    }
    /*
    if (channel_duty < 0) {
        channel_duty = 0;
    } else if (channel_duty >= timer_duty) {
        // When channel's binded timer selects its maximum duty resolution,
        // the duty cycle value cannot be set to (2 ** duty_resolution)
        channel_duty = timer_duty - 1; // Ok!
    }
    */
    self->channel_duty = channel_duty;

    ledc_channel_config_t cfg = {
        .channel = self->channel,
        .duty = self->channel_duty,
        .gpio_num = self->pin,
        .intr_type = LEDC_INTR_DISABLE,
        .speed_mode = self->mode,
        .timer_sel = self->timer,
        .flags.output_invert = self->output_invert,
    };
    debug_printf4("apply_duty():self->channel_duty=%d, timer_duty=%d, cfg.flags.output_invert=%d", self->channel_duty, timer_duty, cfg.flags.output_invert)
    if (self->channel_duty == timer_duty) {
        cfg.duty = 0;
        cfg.flags.output_invert = self->output_invert ^ 1;
    }
    check_esp_err(ledc_channel_config(&cfg));
//    if (ledc_channel_config(&cfg) != ESP_OK) {
  //      mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("PWM not supported on Pin(%d)"), self->pin);
    //}
}

static unsigned int calc_divider(uint32_t src_clk_freq, uint32_t timer_freq) {
    unsigned int divider = (src_clk_freq + timer_freq / 2) / timer_freq; // rounded
    if (divider == 0) {
        divider = 1;
    }
    return divider;
}

// Temporary workaround for ledc_find_suitable_duty_resolution function only being added in IDF V5.2
#if 1//ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 2, 0)
static uint32_t Qledc_find_suitable_duty_resolution(uint32_t src_clk_freq, uint32_t timer_freq) {
    // This implementation is based on the one used in Micropython v1.23

    // Find the highest bit resolution for the requested frequency
    unsigned int freq = src_clk_freq;
    unsigned int divider = calc_divider(freq, timer_freq);
    float f = (float)freq / divider; // actual frequency
    if (f <= 1.0) {
        f = 1.0;
    }
    freq = (unsigned int)roundf((float)freq / f);

    unsigned int res = 0;
    for (; freq > 1; freq >>= 1) {
        ++res;
    }
    return res;
}
#endif

static uint32_t find_suitable_duty_resolution(uint32_t src_clk_freq, uint32_t timer_freq) {
    unsigned int res0 = ledc_find_suitable_duty_resolution(src_clk_freq, timer_freq);
    unsigned int res = Qledc_find_suitable_duty_resolution(src_clk_freq, timer_freq);
    debug_printf3("res=%d, res0=%d", res, res0)
    if (res == 0) {
        res = 1;
    } else if (res > HIGHEST_PWM_RES) {
        // Limit resolution to HIGHEST_PWM_RES to match units of our duty
        res = HIGHEST_PWM_RES;
    }
    return res;
}

#define get_duty_raw(self) ledc_get_duty(self->mode, self->channel)

static uint32_t get_duty_u16(machine_pwm_obj_t *self) {
    pwm_is_active(self);
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    debug_printf("MAX_TIMER_DUTY=%d timer->duty_resolution=%d self->channel_duty=%d get_duty_raw()=%d", MAX_TIMER_DUTY, timer->duty_resolution, self->channel_duty, get_duty_raw(self))

    debug_printf2("get_duty_u16():self->output_invert=%d, get_duty_raw(self)=%d", self->output_invert, get_duty_raw(self))
    //if ((self->channel_duty == timer_duty) || (get_duty_raw(self) >= timer_duty)) {
    if (self->channel_duty == timer_duty) {
        return UI16_DUTY;
        //return self->output_invert == 0 ? UI16_DUTY : 0;
        //return HIGHEST_PWM_RES;
    } else {
        /*
        if ((self->output_invert) && (get_duty_raw(self) == 0)) {
            return UI16_DUTY;
        }
        */
        int duty_resolution = timers[self->mode][self->timer].duty_resolution;
        debug_printf2("duty_resolution=%d", duty_resolution)
        if (duty_resolution <= UI_RES_16_BIT) {
            return get_duty_raw(self) << (UI_RES_16_BIT - duty_resolution);
        } else {
            return get_duty_raw(self) >> (duty_resolution - UI_RES_16_BIT);
        }
    }
}

static uint32_t get_duty_u10(machine_pwm_obj_t *self) {
    return get_duty_u16(self) >> (UI_RES_16_BIT - UI_RES_10_BIT); // Scale down from 16 bit to 10 bit resolution
}

static uint32_t get_duty_ns(machine_pwm_obj_t *self) {
    return duty_to_ns(self, get_duty_u16(self));
}

static void set_duty_u16(machine_pwm_obj_t *self, int duty) {
    if ((duty < 0) || (duty > UI16_DUTY)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty_u16 must be from 0 to %d"), UI16_DUTY);
    }

    self->duty_x = UI_RES_16_BIT;
    self->duty_ui = duty;
    apply_duty(self);
    /*
    #define USE_THREAD_SAFE_LEDC_API 0
    #if USE_THREAD_SAFE_LEDC_API
    check_esp_err(ledc_set_duty_and_update(self->mode, self->channel, channel_duty, timer_duty - 1));
    esp_err_t err = ESP_OK; // ledc_set_duty_and_update(self->mode, self->channel, channel_duty, timer_duty - 1);
    if (err != ESP_OK)
    #endif
    {
        check_esp_err(ledc_set_duty(self->mode, self->channel, channel_duty));
        check_esp_err(ledc_update_duty(self->mode, self->channel));
    }
    */
}

