micropython/micropython/ports/esp32/machine_pwm.c
static void set_duty_u10(machine_pwm_obj_t *self, int duty) {
    if ((duty < 0) || (duty > UI10_DUTY)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty must be from 0 to %u"), UI10_DUTY);
    }
    // set_duty_u16(self, duty << (UI_RES_16_BIT - UI_RES_10_BIT));
    self->duty_x = UI_RES_10_BIT;
    self->duty_ui = duty;
    apply_duty(self);
}

static void set_duty_ns(machine_pwm_obj_t *self, int ns) {
    if ((ns < 0) || (ns > duty_to_ns(self, UI16_DUTY))) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("duty_ns must be from 0 to %d ns"), duty_to_ns(self, UI16_DUTY));
    }
    // set_duty_u16(self, ns_to_duty(self, ns));
    self->duty_x = -UI_RES_16_BIT;
    self->duty_ui = ns;
    apply_duty(self);
}

static void set_duty(machine_pwm_obj_t *self) {
    if (self->duty_x == UI_RES_16_BIT) {
        set_duty_u16(self, self->duty_ui);
    } else if (self->duty_x == UI_RES_10_BIT) {
        set_duty_u10(self, self->duty_ui);
    } else if (self->duty_x == -UI_RES_16_BIT) {
        set_duty_ns(self, self->duty_ui);
    }
}

// Set timer frequency
static void set_freq(machine_pwm_obj_t *self, unsigned int freq) {
    ledc_timer_config_t *timer = &timers[self->mode][self->timer];
    if (timer->freq_hz != freq) {
        timer->freq_hz = freq;
        timer->clk_cfg = LEDC_AUTO_CLK;
        uint32_t src_clk_freq = 0;

        #if SOC_LEDC_SUPPORT_APB_CLOCK
        timer->clk_cfg = LEDC_USE_APB_CLK;
        src_clk_freq = APB_CLK_FREQ; // 80 MHz
        #elif SOC_LEDC_SUPPORT_PLL_DIV_CLOCK
        timer->clk_cfg = LEDC_USE_PLL_DIV_CLK;
        #elif SOC_LEDC_SUPPORT_XTAL_CLOCK
        timer->clk_cfg = LEDC_USE_XTAL_CLK;
        src_clk_freq = XTAL_CLK_FREQ; // 40 MHz
        #else
        #error No supported PWM / LEDC clocks.
        #endif

        #ifdef EMPIRIC_FREQ
        if (freq < EMPIRIC_FREQ) {
            #if SOC_LEDC_SUPPORT_REF_TICK
            timer->clk_cfg = LEDC_USE_REF_TICK;
            src_clk_freq = REF_CLK_FREQ; // 1 MHz
            #else
            #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 2)
            timer->clk_cfg = LEDC_USE_RC_FAST_CLK;
            src_clk_freq = SOC_CLK_RC_FAST_FREQ_APPROX; // 8.5 or 17.5 MHz
            #elif defined(XTAL_CLK_FREQ)
            timer->clk_cfg = LEDC_USE_XTAL_CLK;
            src_clk_freq = XTAL_CLK_FREQ; // 40MHz // 32MHz
            #endif
            #endif
        }
        #endif

        debug_printf4("src_clk_freq=%d, timer->freq_hz=%d, timer->clk_cfg=%d", src_clk_freq, timer->freq_hz, timer->clk_cfg)
        #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 1, 0)
        esp_err_t err = esp_clk_tree_src_get_freq_hz(timer->clk_cfg, ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED, &src_clk_freq);
        if (err != ESP_OK) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("unable to query source clock frequency %d"), (int)timer->clk_cfg);
        }
        #endif

        debug_printf4("src_clk_freq=%d, timer->freq_hz=%d, timer->clk_cfg=%d", src_clk_freq, timer->freq_hz, timer->clk_cfg)
        // Configure the new resolution and frequency
        timer->duty_resolution = find_suitable_duty_resolution(src_clk_freq, timer->freq_hz);

        // Configure timer - Set frequency
        if (ESP_OK != ledc_timer_config(timer)) {
            unsigned int divider = calc_divider(src_clk_freq, timer->freq_hz);
            check_esp_err(ledc_timer_set(timer->speed_mode, timer->timer_num, divider, timer->duty_resolution, timer->clk_cfg));
        }
        // Reset the timer if low speed
        if (self->mode == LEDC_LOW_SPEED_MODE) {
            check_esp_err(ledc_timer_rst(self->mode, self->timer));
        }

        // Save the same duty cycle when frequency is changed
        set_duty(self);
    }
}

static bool is_free_channels(int mode, int pin) {
    for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
        if ((chans[mode][channel].pin < 0) || (chans[mode][channel].pin == pin)) {
            return true;
        }
    }

    return false;
}

// Find self channel or free channel in the mode
static int find_channel(int mode, int pin) {
    int avail_channel = -1;
    for (int channel = 0; channel < LEDC_CHANNEL_MAX; ++channel) {
        if (chans[mode][channel].pin == pin) {
            return channel;
        }
        if ((avail_channel < 0) && (chans[mode][channel].pin < 0)) {
            avail_channel = channel;
        }
    }
    return avail_channel;
}

// Returns timer with the same mode and frequency, freq == -1 means free timer
#define find_timer(mode, freq) _find_timer(mode, freq); debug_printf0("find_timer(mode=%d, freq=%d)", mode, freq);
static int _find_timer(int mode, unsigned int freq) {
    for (int timer = 0; timer < LEDC_TIMER_MAX; ++timer) {
        if (timers[mode][timer].freq_hz == freq) {
            return timer;
        }
    }
    return -1;
}

// Try to find a timer with the same frequency in the current mode, otherwise in the next mode.
// If no existing timer and channel was found, then try to find free timer in any mode.
// If the mode or channel is changed, release the channel and select(bind) a new channel in the next mode.
#define select_a_timer(self, freq) debug_printf0("select_a_timer(freq=%d)", freq); _select_a_timer(self, freq);
static void _select_a_timer(machine_pwm_obj_t *self, int freq) {
    // mode, channel, timer may be -1(not defined) or actual values
    int save_mode = self->mode;
    int save_channel = self->channel;
    // int save_timer = self->timer;

    int mode = MAX(self->mode, 0);

    // Check if an already running timer with the required frequency is running in the current mode
    int timer = -1;
    if (is_free_channels(mode, self->pin)) {
        timer = find_timer(mode, freq);
    }
    // If no existing timer and channel was found in the current mode, then find a new one in another mode
    if (timer < 0) {
        // Calc next mode
        int mode_ = mode;
        if (mode > 0) {
            --mode;
        } else if (mode < (LEDC_SPEED_MODE_MAX - 1)) {
            ++mode;
        }

