micropython/micropython/ports/esp32/machine_pwm.c
        if (mode_ != mode) {
            if (is_free_channels(mode, self->pin)) {
                timer = find_timer(mode, freq);
            }
        }
    }
    // If the timer is found, then bind and set the duty
    debug_printf0("timer=%d, timers[mode][timer].freq_hz=%d, self->channel=%d, self->mode=%d", timer, timers[mode][timer].freq_hz, self->channel, self->mode);
    if ((timer >= 0)
        && (timers[mode][timer].freq_hz != 0)
        && (timers[mode][timer].freq_hz != freq)
        && (self->channel >= 0)
        && (self->mode >= 0)) {
        // Bind the channel to the timer
        self->mode = mode;
        self->timer = timer;
        check_esp_err(ledc_bind_channel_timer(self->mode, self->channel, self->timer));
        register_channel(self->mode, self->channel, self->pin, self->timer);
    } else {
        ////// timer = -1;
    }
    if (timer >= 0) {
        self->timer = timer;
        set_duty(self);
    }

    if (timer < 0) {
        // Try to reuse self timer
        if ((self->mode >= 0) && (self->channel >= 0)) {
            if (!is_timer_in_use(self->mode, self->channel, self->timer)) {
                mode = self->mode;
                timer = self->timer;
            }
        }
        // If no existing timer and channel was found, then try to find free timer in any mode
        if (timer < 0) {
            mode = -1;
            while ((timer < 0) && (mode < (LEDC_SPEED_MODE_MAX - 1))) {
                ++mode;
                if (is_free_channels(mode, self->pin)) {
                    timer = find_timer(mode, -1); // find free timer
                }
            }
            if (timer < 0) {
                mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM timers:%d"), LEDC_SPEED_MODE_MAX * LEDC_TIMER_MAX);
            }
        }
        self->mode = mode;
        self->timer = timer;
    }
    if ((save_mode != self->mode) || (save_channel != self->channel)) {
        unregister_channel(save_mode, save_channel);
    }
}

/******************************************************************************/
// MicroPython bindings for PWM

static void mp_machine_pwm_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    machine_pwm_obj_t *self = MP_OBJ_TO_PTR(self_in);
    mp_printf(print, "PWM(Pin(%u)", self->pin);
    if (self->timer >= 0) {
        mp_printf(print, ", freq=%u", ledc_get_freq(self->mode, self->timer));

        if (self->duty_x == UI_RES_10_BIT) {
            mp_printf(print, ", duty=%d", get_duty_u10(self));
        } else if (self->duty_x == -UI_RES_16_BIT) {
            mp_printf(print, ", duty_ns=%d", get_duty_ns(self));
        } else {
            mp_printf(print, ", duty_u16=%d", get_duty_u16(self));
        }
        if (self->output_invert) {
            mp_printf(print, ", invert=%d", self->output_invert);
        }
        mp_printf(print, ")");
        #if 1//MICROPY_ERROR_REPORTING > MICROPY_ERROR_REPORTING_NORMAL
        int duty_resolution = timers[self->mode][self->timer].duty_resolution;
        mp_printf(print, "  # duty_resolution=%d, get_duty_raw(self)=%d", duty_resolution, get_duty_raw(self));

        mp_printf(print, ", (duty=%.2f%%, duty_resolution=%.6f%%)", 100.0 * get_duty_u16(self) / UI16_DUTY, 100.0 * 1 / (1 << duty_resolution)); // percents

        mp_printf(print, ", mode=%d, channel=%d, timer=%d", self->mode, self->channel, self->timer);
        #endif
    } else {
        mp_printf(print, ")");
    }
}

// This called from pwm.init() method
/*
Check the current mode.
If the frequency is changed, try to find a timer with the same frequency
in the current mode, otherwise in the new mode.
If the mode is changed, release the channel and select a new channel in the new mode.
Then set the frequency with the same duty.
*/
static void mp_machine_pwm_init_helper(machine_pwm_obj_t *self,
    size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {

    enum { ARG_freq, ARG_duty, ARG_duty_u16, ARG_duty_ns, ARG_invert };
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_freq, MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_duty, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_duty_u16, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_duty_ns, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1} },
        { MP_QSTR_invert, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = -1}},
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args,
        MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    int freq = args[ARG_freq].u_int;
    if (freq != -1) {
        if ((freq <= 0) || (freq > 40000000)) {
            mp_raise_ValueError(MP_ERROR_TEXT("frequency must be from 1Hz to 40MHz"));
        }
    }

    int duty = args[ARG_duty].u_int;
    int duty_u16 = args[ARG_duty_u16].u_int;
    int duty_ns = args[ARG_duty_ns].u_int;
    /*
    if (((duty != -1) && (duty_u16 != -1)) || ((duty != -1) && (duty_ns != -1)) || ((duty_u16 != -1) && (duty_ns != -1))) {
        mp_raise_ValueError(MP_ERROR_TEXT("only one of parameters 'duty', 'duty_u16' or 'duty_ns' is allowed"));
    }
    */
    /*
    if ((duty < 0) && (duty_u16 < 0) && (duty_ns < 0)) {
        mp_raise_ValueError(MP_ERROR_TEXT("one of parameters 'duty', 'duty_u16', or 'duty_ns' is required"));
    }
    */
    if (duty_u16 >= 0) {
        self->duty_x = UI_RES_16_BIT;
        self->duty_ui = duty_u16;
    } else if (duty_ns >= 0) {
        self->duty_x = -UI_RES_16_BIT;
        self->duty_ui = duty_ns;
    } else if (duty >= 0) {
        self->duty_x = UI_RES_10_BIT;
        self->duty_ui = duty;
    } else if (self->duty_x == 0) {
        self->duty_x = UI_RES_16_BIT;
        self->duty_ui = (1 << UI_RES_16_BIT) / 2; // default 50%
    }

    int output_invert = args[ARG_invert].u_int;
    if (output_invert >= 0) {
        self->output_invert = output_invert == 0 ? 0 : 1;
    }

    int save_mode = self->mode;
    int save_channel = self->channel;
    int save_timer = self->timer;

    // Check the current mode and channel
    int mode = -1;
    int channel = -1;
    while ((channel < 0) && (mode < (LEDC_SPEED_MODE_MAX - 1))) {
        ++mode;
        channel = find_channel(mode, self->pin);
    }
    if (channel < 0) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("out of PWM channels:%d"), LEDC_SPEED_MODE_MAX * LEDC_CHANNEL_MAX); // in all modes
    }
    self->mode = mode;
    self->channel = channel;

    // Check if freq wasn't passed as an argument
    if ((freq == -1) && (mode >= 0) && (channel >= 0)) {
        // Check if already set, otherwise use the default freq.
        // It is possible in case:
        // pwm = PWM(pin, freq=1000, duty=256)
        // pwm = PWM(pin, duty=128)
        if (chans[mode][channel].timer >= 0) {
            freq = timers[mode][chans[mode][channel].timer].freq_hz;
        }
        if (freq <= 0) {
            freq = PWM_FREQ;
        }
    }

    select_a_timer(self, freq);

    // New PWM assignment
    if ((chans[mode][channel].pin < 0)
        || ((save_mode != self->mode))
        || ((save_channel != self->channel))
        || ((save_timer != self->timer))) {
        debug_printf("mp_machine_pwm_init_helper()")
        apply_duty(self);
        configure_pin(self);
        register_channel(self->mode, self->channel, self->pin, self->timer);
    } else {
        set_freq(self, freq);
    }
}

static void self_reset(machine_pwm_obj_t *self) {
    self->mode = -1;
    self->channel = -1;
    self->timer = -1;
    self->duty_x = 0;
    self->duty_ui = 0;
    self->channel_duty = 0;
    self->output_invert = 0;
}

// This called from PWM() constructor
static mp_obj_t mp_machine_pwm_make_new(const mp_obj_type_t *type,
    size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 1, 2, true);
    gpio_num_t pin = machine_pin_get_id(args[0]);

    // create PWM object from the given pin
    machine_pwm_obj_t *self = mp_obj_malloc(machine_pwm_obj_t, &machine_pwm_type);
    self->pin = pin;
    self_reset(self);

    // start the PWM subsystem if it's not already running
    if (!pwm_inited) {
        #if USE_THREAD_SAFE_LEDC_API
        ledc_fade_func_install(ESP_INTR_FLAG_INTRDISABLED);
        #endif
        pwm_init();
        pwm_inited = true;
    }

    // start the PWM running for this channel
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_pwm_init_helper(self, n_args - 1, args + 1, &kw_args);

